from ..repository import global_repository

THAI = "ไทย"
COUNTRY_LIST = "รายชื่อประเทศ"
USAGE = "วิธีใช้งาน"
CREDIT = "เครดิต"
COUNTRY_NAMES = global_repository.get_menu_keys()
ERROR = "ผลการค้นหาของคุณไม่ตรงกับคีย์เวิร์ดที่กำหนด คุณสามารถเลือกเมนู วิธีใช้งาน เพื่อดูวิธีการค้นหา"
USAGE_REPLY = "วิธีใช้งาน กรุณาพิมพ์คีย์เวิร์ดต่อไปนี้ หรือเลือกเมนูด้านล่าง\n\n1. \"ไทย\" \n(cellphone) ดูอัพเดตล่าสุดของประเทศไทย\n\n2. \"รายชื่อประเทศ\" \n(train)ดูรายชื่อประเทศทั้งหมดที่มีข้อมูล\n\n3. พิมพ์ชื่อประเทศที่ต้องการข้อมูลเป็นภาษาอังกฤษลงในกล่องข้อความและส่ง (สามารถดูชื่อประเทศได้ในข้อ 2)\n\(blue) เนื่องจากกำลังอยู่ในช่วงพัฒนา เมื่อท่านต้องการค้นหาประเทศอื่นๆ กรุณาพิมพ์คียเวิร์ดให้ตรงกับชื่อประเทศในข้อ 2 ด้วย"
VERSION = "1.0"
CREDIT = "พัฒนาโดย นายนนทวัฒน์ วุฒิคำ นักศึกษาชั้นปีที่ 2 สาขาวิศวกรรมคอมพิวเตอร์ สถาบันการจัดการปัญญาภิวัฒน์\n\nอ้างอิง : https://ddc.moph.go.th/viralpneumonia/ \n\nขอขอบคุณ Python API module จาก FACEBOOK PAGE : ลุงวิศวกร สอนคำนวน  \n\nพัฒนาด้วย LINE BOT SDK, LINE MESSAGING API, PYTHON,FLASK,HEROKU \n\nLINE BOT นี้เป็นโปรแกรมที่พัฒนาโดยมีจุดประสงค์เพื่อการศึกษาเท่านั้น"